# Разбор ДЗ

## Домашнее задание: Kaggle. Титаник.

In [2]:
import pandas as pd
data_train = pd.read_csv('data/titanic/train.csv')
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data_test = pd.read_csv('data/titanic/test.csv')
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Предобработка данных

### Задание 1. Закодировать категориальные признаки числами (2 балла)
Пример: в колонке Sex сейчас значения male и female. Вы должны все male заменить на 1, все female - на 2. Аналогично для Embarked

In [10]:
data_train.loc[data_train.Sex == 'male','Sex'] = 1
data_train.loc[data_train.Sex == 'female','Sex'] = 2

data_train.loc[data_train.Embarked == 'S','Embarked'] = 1
data_train.loc[data_train.Embarked == 'C','Embarked'] = 2
data_train.loc[data_train.Embarked == 'Q','Embarked'] = 3

data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,38.0,1,0,PC 17599,71.2833,C85,2
2,3,1,3,"Heikkinen, Miss. Laina",2,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",2,35.0,1,0,113803,53.1000,C123,1
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,1

In [11]:
data_test.loc[data_test.Sex == 'male','Sex'] = 1
data_test.loc[data_test.Sex == 'female','Sex'] = 2

data_test.loc[data_test.Embarked == 'S','Embarked'] = 1
data_test.loc[data_test.Embarked == 'C','Embarked'] = 2
data_test.loc[data_test.Embarked == 'Q','Embarked'] = 3

data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,3
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",2,47.0,1,0,363272,7.0000,NaN,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,3
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",2,22.0,1,1,3101298,12.2875,NaN,1

### Задание 2. Заменить пропущенные значения Age и Fare на медианные значения (2 балла)
Если кто-то забыл что такое медиана - гугл вам поможет

In [17]:
data_train.loc[data_train.Age.isnull(),'Age'] = data_train['Age'].median()
data_train.loc[data_train.Fare.isnull(),'Fare'] = data_train['Fare'].median()

data_test.loc[data_test.Age.isnull(),'Age'] = data_test['Age'].median()
data_test.loc[data_test.Fare.isnull(),'Fare'] = data_test['Fare'].median()

### Задание 3. Записать признаки, которые вы будете использовать в переменную X, а целевую переменную в y (2 балла)
Мы делали похожее задание на уроке, если не знаете как делать - смотрите конспект.

In [18]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,38.0,1,0,PC 17599,71.2833,C85,2
2,3,1,3,"Heikkinen, Miss. Laina",2,26.0,0,0,STON/O2. 3101282,7.9250,NaN,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",2,35.0,1,0,113803,53.1000,C123,1
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,1

In [23]:
X = data_train.ix[:, [2, 4, 5, 6, 7, 9]].values
y = data_train.ix[:, 1]

### Задание 4. Обучить модель логистической регрессии, сделать предсказания для тестовой выборки, загрузить решение на kaggle (4 балла)

In [24]:
from sklearn.linear_model import LogisticRegression
C = 1
logit = LogisticRegression(C=C, n_jobs=-1, random_state=17)
logit.fit(X, y)
round(logit.score(X, y), 3)

0.79100000000000004

In [30]:
X_test = data_test.ix[:, [1, 3, 4, 5, 6, 8]].values
y_test = logit.predict(X_test)

In [36]:
with open('prediction.txt', 'w') as f:
    for i in y_test:
        f.write(str(i) + '\n')